# parameters

nc: 1  # number of classes
nkpt: 4 # number of keypoints
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
dw_conv_kpt: True

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2, None]],  # 1-P2/4

   [-1, 1, Conv, [32, 1, 1, None]],
   [-2, 1, Conv, [32, 1, 1, None]],
   [-1, 1, Conv, [32, 3, 1, None]],
   [-1, 1, Conv, [32, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None]],  # 7


   [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 8-P3/4
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   #   [-1, 1, MP, []],  # 8-P3/8
   [-1, 1, Conv, [64, 1, 1, None]],
   [-2, 1, Conv, [64, 1, 1, None]],
   [-1, 1, Conv, [64, 3, 1, None]],
   [-1, 1, Conv, [64, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None]],  # 15

   [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 16-P4/4
   [ -1, 1, Conv, [ 128, 1, 1 ] ],
#   [-1, 1, MP, []],  # 15-P4/16
   [-1, 1, Conv, [128, 1, 1, None]],
   [-2, 1, Conv, [128, 1, 1, None]],
   [-1, 1, Conv, [128, 3, 1, None]],
   [-1, 1, Conv, [128, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None]],  # 23

   [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 24-P5/4
   [ -1, 1, Conv, [ 256, 1, 1 ] ],
#   [-1, 1, MP, []],  # 22-P5/32
   [-1, 1, Conv, [256, 1, 1, None]],
   [-2, 1, Conv, [256, 1, 1, None]],
   [-1, 1, Conv, [256, 3, 1, None]],
   [-1, 1, Conv, [256, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None]],  # 28  31
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None]],
   [-2, 1, Conv, [256, 1, 1, None]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None]],  # 37   40

   [-1, 1, Conv, [128, 1, 1, None]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [21, 1, Conv, [128, 1, 1, None]], # route backbone P4
   [22, 1, Conv, [128, 1, 1, None]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None]],
   [-2, 1, Conv, [64, 1, 1, None]],
   [-1, 1, Conv, [64, 3, 1, None]],
   [-1, 1, Conv, [64, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None]],  # 47    50

   [-1, 1, Conv, [64, 1, 1, None]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [14, 1, Conv, [64, 1, 1, None]], # route backbone P3
   [15, 1, Conv, [64, 1, 1, None]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [32, 1, 1, None]],
   [-2, 1, Conv, [32, 1, 1, None]],
   [-1, 1, Conv, [32, 3, 1, None]],
   [-1, 1, Conv, [32, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None]],  # 57   60

   [-1, 1, Conv, [128, 3, 2, None]],
#   [[-1, 47], 1, Concat, [1]],
   [[-1, 50], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None]],
   [-2, 1, Conv, [64, 1, 1, None]],
   [-1, 1, Conv, [64, 3, 1, None]],
   [-1, 1, Conv, [64, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None]],  # 65   68

   [-1, 1, Conv, [256, 3, 2, None]],
#   [[-1, 37], 1, Concat, [1]],
   [[-1, 40], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None]],
   [-2, 1, Conv, [128, 1, 1, None]],
   [-1, 1, Conv, [128, 3, 1, None]],
   [-1, 1, Conv, [128, 3, 1, None]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None]],  # 73   76

   [60, 1, Conv, [128, 3, 1, None]],
   [68, 1, Conv, [256, 3, 1, None]],
   [76, 1, Conv, [512, 3, 1, None]],

   [[77,78,79], 1, IKeypoint, [nc, anchors,nkpt]],   # Detect(P3, P4, P5)
  ]